---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedServiceId
source: html/8e4f74ef-28e8-c726-004c-86e5fc0f7953.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedServiceId Property

The mapped service identifier of the straight.

## Syntax (C#)
```csharp
public int MappedServiceId { get; set; }
```